# Práctica SQL ejercicios

¿Cómo usar?<br>
Correr las celdas individualmente para resolver cada ejercicio.<br>
<br>

La función q('') toma entre las comillas una sentencia SQL e imprime el resultado de la query<br>
La función verTabla('') muestra la estructura de la tabla<br>

Shortcuts útiles: <br>
                shift + enter -> corre celda<br>
                esc + o       -> oculta/muestra resultado impreso<br>

In [35]:
#Import sqlite para acceder a base
import sqlite3
import pandas as pd

#Poner acá el path a la base
archivoBase = 'practica-sql.db'

#Conectar a base
conn = sqlite3.connect(archivoBase)
c = conn.cursor()

In [51]:
#Función q para realizar Queries
def q(sent):
     return pd.read_sql_query(sent, conn)
     

#Función para ver estructura de las tablas. El nombre de tabla va como string
def verTabla (tabla):
    table = str(tabla)
    return pd.read_sql_query(f'PRAGMA table_info("{table}")', conn)

Ver tablas de la base

In [42]:
q(
'select name from sqlite_master where type="table";')

            name
0  departamentos
1      empleados
2        ordenes
3      productos
4    proveedores
5      renglones

Ver estructura de la tabla ""

In [50]:
verTabla('empleados')

    cid            name           type  notnull dflt_value  pk
0     0          nombre   varchar(255)        0         ''   0
1     1           calle   varchar(255)        0         ''   0
2     2          numero   varchar(255)        0         ''   0
3     3            piso   varchar(255)        0         ''   0
4     4           depto   varchar(255)        0         ''   0
5     5            sexo   varchar(255)        0         ''   0
6     6  tipo_documento   varchar(255)        0         ''   0
7     7    estado_civil   varchar(255)        0         ''   0
8     8          codigo  decimal(28,0)        1        '0'   1
9     9   nro_documento  decimal(28,0)        1        '0'   0
10   10         salario  decimal(28,0)        1        '0'   0
11   11        comision  decimal(28,0)        0        '0'   0
12   12      codigo_dep  decimal(28,0)        0        '0'   0

In [40]:
verTabla('proveedores')

[(0, 'nombre', 'varchar(255)', 0, "''", 0),
 (1, 'direccion', 'varchar(255)', 0, "''", 0),
 (2, 'ciudad', 'varchar(255)', 0, "''", 0),
 (3, 'telefono', 'varchar(255)', 0, "''", 0),
 (4, 'tipo_credito', 'varchar(255)', 0, "''", 0),
 (5, 'codigo', 'decimal(28,0)', 1, "'0'", 1)]

## Ejercicios

### 1 SENTENCIA SELECT

a) Mostrar el contenido de la tabla empleados.

In [40]:
q(
    'select * from empleados;')

,nombre,calle,numero,piso,depto,sexo,tipo_documento,estado_civil,codigo,nro_documento,salario,comision,codigo_dep
0,Perez Carlos Alberto,Parana,555,None,None,M,DNI,SOLTERO,1,23194853,20600,1000.0,1
1,Jaime Daniel,Pasco,1685,5,A,M,DNI,CASADO,2,15354702,15500,NaN,3
2,Miranda Adriana,Jujuy,204,3,H,F,CI,CASADO,3,7862169,17750,1500.0,2
3,Cucagna Karina,Forest,856,PB,A,F,DNI,SOLTERO,4,24578699,15500,NaN,5
4,Soria Laura,Av. Corrientes,5489,14,C,F,DNI,CASADO,5,25471025,22000,NaN,4
5,Scorza Miguel,Holanda,245,None,None,M,DNI,CASADO,6,8234977,15500,NaN,1
6,Deluca Luis,Lima,399,1,D,M,DNI,CASADO,7,24614722,18800,3500.0,2
7,Cosio Alejandro,Cordoba,2185,5,W,M,DNI,CASADO,8,10547932,19900,2500.0,3
8,Fernandez Maria Cristina,Cordoba,4885,1,A,F,DNI,SOLTERO,9,17547222,13300,NaN,3
9,Fernandez Sofia,Alambes,344,None,None,F,DNI,CASADO,10,11847562,13300,2500.0,3
10,Rodriguez Carlos Alberto,Guido,1234,5,None,M,DNI,CASADO,11,12987677,29900,4500.0,5
11,Marto Lima Fracesca,Av. del Corral,2334,None,None,F,CI,DIVORCIADO,12,10547932,29900,5500.0,5
12,Coronda Ana Laura,Rawson,123,None,None,F,DNI,SOLTERO,13,24459333,9900,NaN,6
13,Casaso Martin,Julian Alvarez,2223,10,H,M,CI,VIUDO,14,10897878,14400,1000.0,6
14,Martinez Javier Alberto,Del Solar,32,None,None,M,CI,SOLTERO,15,30495887,7700,NaN,6
15,Puan Sandra Maria,Pasaje del Pilar,56,12,None,F,DNI,CASADO,16,18123444,11100,150.0,2
16,Valle Alerce Maria,Libertador,3444,23,None,F,DNI,CASADO,17,12555532,39900,550.0,6
17,Asalez Marcos,Sarandi,455,6,J,M,DNI,SOLTERO,18,19542382,7700,NaN,3

b) Mostrar el nombre y teléfono de los proveedores.

In [52]:
q('''
  SELECT p.nombre, p.telefono 
  FROM proveedores p;
     ''')

                           nombre     telefono
0                  ATALAYA S.R.L.    4777-3456
1                ROCAMORA E HIJOS    4752-7620
2                      LA PERUANA    4432-0485
3                       RUTA S.A.    4285-0932
4                       COMODINES    4436-9332
5                        LA SEXTA   02336-9332
6       AGUSTINEZ Y HERMANOS S.A.    4554-9344
7       PEREZ, PEREZ, Y RODRIGUEZ    4999-1313
8   AGUSTIN FERNANDEZ Y ASOCIADOS  023-36-7727
9                   COMODO S.R.L.    0996-1122
10                          PARIS  021-26-1220
11                    MIS LAPICES    1212-3332

### 2 RESTRICCIÓN Y ORDENAMIENTO DE LAS BÚSQUEDAS

a) Mostrar el nombre, salario y estado civil de los empleados del departamento 5.

In [51]:
q('select e.nombre, e.salario, e.estado_civil from empleados e where e.codigo_dep = 5')

('Cucagna Karina', 15500, 'SOLTERO')
('Rodriguez Carlos Alberto', 29900, 'CASADO')
('Marto Lima Fracesca', 29900, 'DIVORCIADO')

b) Mostrar el nombre, salario y estado civil de los empleados del departamento 5 que estén casados.

In [53]:
q('select e.nombre, e.salario, e.estado_civil from empleados e where e.codigo_dep = 5 AND e.estado_civil = "CASADO";')

('Rodriguez Carlos Alberto', 29900, 'CASADO')

c) Ordenar el resultado obtenido por nombre del empleado.

In [54]:
q('SELECT e.nombre, e.salario, e.estado_civil FROM empleados e WHERE e.codigo_dep = 5 AND e.estado_civil = "CASADO" ORDER BY e.nombre;')

('Rodriguez Carlos Alberto', 29900, 'CASADO')

d) Listar el nombre y la suma del salario y comisión de los empleados que ganen más de 15500 pesos de los departamentos 2 y 5.

In [53]:
q('select e.nombre, (e.salario+e.comision) AS sumaSalarioComision from empleados e where e.salario > 15500 AND (e.codigo_dep = 2 OR e.codigo_dep = 5);')

                     nombre  sumaSalarioComision
0           Miranda Adriana                19250
1               Deluca Luis                22300
2  Rodriguez Carlos Alberto                34400
3       Marto Lima Fracesca                35400

e) Listar los empleados con sus salarios y comisiones y calcular el salario anual considerando que el aguinaldo equivale a un mes de sueldo sin contar la comisión.

In [59]:
q('SELECT e.nombre, e.salario, e.comision, (e.salario*12) AS salarioAnual FROM empleados e')

('Perez Carlos Alberto', 20600, 1000, 247200)
('Jaime Daniel', 15500, None, 186000)
('Miranda Adriana', 17750, 1500, 213000)
('Cucagna Karina', 15500, None, 186000)
('Soria Laura', 22000, None, 264000)
('Scorza Miguel', 15500, None, 186000)
('Deluca Luis', 18800, 3500, 225600)
('Cosio Alejandro', 19900, 2500, 238800)
('Fernandez Maria Cristina', 13300, None, 159600)
('Fernandez Sofia', 13300, 2500, 159600)
('Rodriguez Carlos Alberto', 29900, 4500, 358800)
('Marto Lima Fracesca', 29900, 5500, 358800)
('Coronda Ana Laura', 9900, None, 118800)
('Casaso Martin', 14400, 1000, 172800)
('Martinez Javier Alberto', 7700, None, 92400)
('Puan Sandra Maria', 11100, 150, 133200)
('Valle Alerce Maria', 39900, 550, 478800)
('Asalez Marcos', 7700, None, 92400)

f) Mostrar los renglones de las órdenes calculando el total de cada renglón.

In [67]:
q('SELECT r.nro_renglon, (r.precio*r.cantidad) AS total FROM renglones r;')

(1, 100)
(2, 820)
(3, 4100)
(1, 2000)
(2, 1464)
(3, 1200)
(4, 648)
(5, 360)
(1, 5680)
(2, 4600)
(3, 5400)
(4, 6710)
(5, 14400)
(6, 4080)
(1, 5000)
(2, 500)
(3, 1000)
(4, 3000)
(1, 310)
(2, 300)
(1, 3720)
(2, 2760)
(3, 760)
(4, 900)
(5, 3240)
(6, 2790)
(7, 1100)
(1, 1100)
(2, 2530)
(3, 720)
(4, 410)
(5, 1734)
(1, 2074)
(2, 2074)
(3, 2880)
(4, 2750)
(1, 2074)
(2, 120)
(3, 144)
(4, 4914)
(5, 60)
(6, 660)
(7, 240)
(8, 240)
(1, 1440)
(2, 250)
(3, 132)
(4, 105)
(5, 9240)
(1, 2160)
(2, 1680)
(3, 1200)
(1, 360)
(2, 300)
(3, 100)
(4, 144)
(5, 744)
(6, 756)
(7, 396)
(8, 400)
(1, 744)
(2, 105)
(3, 200)
(4, 1694)
(1, 2050)
(2, 120)
(3, 612)
(4, 1150)
(5, 100)
(6, 100)
(7, 1224)
(8, 400)
(9, 600)
(1, 820)
(2, 500)
(1, 4100)
(2, 420)
(3, 300)
(4, 50)
(5, 2745)
(1, 50)
(2, 110)
(3, 240)
(4, 600)
(5, 132)
(6, 500)
(1, 600)
(2, 252)
(3, 240)

In [7]:
#Ver encabezado de tabla renglones
c.execute('PRAGMA table_info("renglones")').fetchall()

[(0, 'nro_orden', 'decimal(28,0)', 1, "'0'", 1),
 (1, 'nro_renglon', 'decimal(28,0)', 1, "'0'", 2),
 (2, 'codigo_pro', 'decimal(28,0)', 1, "'0'", 0),
 (3, 'precio', 'decimal(28,0)', 1, "'0'", 0),
 (4, 'cantidad', 'decimal(28,0)', 1, "'0'", 0)]

In [75]:
#Ver todo renglones
q('SELECT * FROM renglones')

(1, 1, 1000223, 10, 10)
(1, 2, 7078080, 41, 20)
(1, 3, 9002006, 41, 100)
(2, 1, 1100334, 40, 50)
(2, 2, 6007023, 61, 24)
(2, 3, 6007045, 120, 10)
(2, 4, 1034219, 54, 12)
(2, 5, 1034311, 30, 12)
(3, 1, 1000225, 71, 80)
(3, 2, 1100333, 230, 20)
(3, 3, 4210002, 120, 45)
(3, 4, 4210004, 61, 110)
(3, 5, 7078092, 120, 120)
(3, 6, 9002003, 340, 12)
(4, 1, 4555102, 50, 100)
(4, 2, 1034219, 5, 100)
(4, 3, 1034310, 10, 100)
(4, 4, 6008070, 30, 100)
(5, 1, 7078092, 31, 10)
(5, 2, 4210002, 10, 30)
(6, 1, 7078090, 31, 120)
(6, 2, 7078092, 230, 12)
(6, 3, 1002106, 380, 2)
(6, 4, 1000225, 30, 30)
(6, 5, 1000223, 81, 40)
(6, 6, 1002024, 31, 90)
(6, 7, 1100333, 10, 110)
(7, 1, 1100333, 10, 110)
(7, 2, 1034108, 230, 11)
(7, 3, 6007045, 30, 24)
(7, 4, 6007055, 41, 10)
(7, 5, 8080803, 51, 34)
(8, 1, 8080803, 61, 34)
(8, 2, 7078090, 61, 34)
(8, 3, 6008070, 120, 24)
(8, 4, 4555108, 50, 55)
(9, 1, 8080803, 61, 34)
(9, 2, 1034311, 10, 12)
(9, 3, 6007055, 6, 24)
(9, 4, 6007066, 91, 54)
(9, 5, 1034108, 20, 3)
(9, 6, 1000223, 10, 66)
(9, 7, 1000225, 60, 4)
(9, 8, 4555104, 60, 4)
(10, 1, 8080803, 60, 24)
(10, 2, 6007066, 50, 5)
(10, 3, 4210002, 11, 12)
(10, 4, 1002025, 21, 5)
(10, 5, 1002106, 120, 77)
(11, 1, 8080803, 60, 36)
(11, 2, 6008070, 70, 24)
(11, 3, 4555102, 50, 24)
(12, 1, 7078092, 60, 6)
(12, 2, 4452025, 30, 10)
(12, 3, 4210002, 10, 10)
(12, 4, 4210003, 6, 24)
(12, 5, 6007045, 31, 24)
(12, 6, 6007066, 21, 36)
(12, 7, 6008070, 11, 36)
(12, 8, 8080803, 40, 10)
(13, 1, 1100333, 31, 24)
(13, 2, 1000223, 21, 5)
(13, 3, 4555108, 40, 5)
(13, 4, 6007045, 121, 14)
(14, 1, 4555108, 41, 50)
(14, 2, 9002004, 10, 12)
(14, 3, 4555104, 51, 12)
(14, 4, 9002006, 230, 5)
(14, 5, 6008070, 10, 10)
(14, 6, 6007023, 10, 10)
(14, 7, 1002025, 51, 24)
(14, 8, 1000224, 20, 20)
(14, 9, 4210002, 6, 100)
(15, 1, 4555108, 41, 20)
(15, 2, 6007055, 10, 50)
(16, 1, 6007023, 41, 100)
(16, 2, 4555108, 21, 20)
(16, 3, 6008058, 30, 10)
(16, 4, 7078080, 10, 5)
(16, 5, 8080803, 61, 45)
(17, 1, 7078080, 10, 5)
(17, 2, 6008058, 11, 10)
(17, 3, 6007055, 20, 12)
(17, 4, 4452024, 50, 12)
(17, 5, 1002106, 11, 12)
(17, 6, 9002003, 100, 5)
(18, 1, 4452024, 50, 12)
(18, 2, 1100334, 21, 12)
(18, 3, 7078080, 20, 12)

g) Mostrar los precios de los productos de las órdenes 2,3, 5, 10, 17 y 18 incrementados en un 10% y redondeados a 2 decimales.

In [6]:
q('SELECT r.codigo_pro, ROUND((r.precio*.10 + r.precio),2) AS nuevoPrecio FROM renglones r WHERE nro_orden = 2 OR nro_orden = 3 OR nro_orden = 5 OR nro_orden = 10 OR nro_orden = 17 OR nro_orden = 18;')

['codigo_pro', 'nuevoPrecio']
(1100334, 44.0)
(6007023, 67.1)
(6007045, 132.0)
(1034219, 59.4)
(1034311, 33.0)
(1000225, 78.1)
(1100333, 253.0)
(4210002, 132.0)
(4210004, 67.1)
(7078092, 132.0)
(9002003, 374.0)
(7078092, 34.1)
(4210002, 11.0)
(8080803, 66.0)
(6007066, 55.0)
(4210002, 12.1)
(1002025, 23.1)
(1002106, 132.0)
(7078080, 11.0)
(6008058, 12.1)
(6007055, 22.0)
(4452024, 55.0)
(1002106, 12.1)
(9002003, 110.0)
(4452024, 55.0)
(1100334, 23.1)
(7078080, 22.0)

h) Hallar los nombres de los empleados con longitud mayor a 15.

In [10]:
q('SELECT e.nombre FROM empleados e WHERE LENGTH(e.nombre)>15;')

['nombre']
('Perez Carlos Alberto',)
('Fernandez Maria Cristina',)
('Rodriguez Carlos Alberto',)
('Marto Lima Fracesca',)
('Coronda Ana Laura',)
('Martinez Javier Alberto',)
('Puan Sandra Maria',)
('Valle Alerce Maria',)

### 3 USO DE FUNCIONES DE GRUPO

a) Hallar el valor máximo, valor mínimo y promedio de sueldos de los empleados.

In [11]:
q('SELECT MAX(e.salario) AS maxSalario, MIN(e.salario) AS minSalario, AVG(e.salario) AS avgSalario FROM empleados e;')

['maxSalario', 'minSalario', 'avgSalario']
(39900, 7700, 17925.0)

b) Mostrar la cantidad de empleados por departamento.

In [12]:
q('SELECT e.codigo_dep, d.n, COUNT(*) AS cantidadEmpleados FROM empleados e GROUP BY e.codigo_dep;')

['codigo_dep', 'cantidadEmpleados']
(1, 2)
(2, 3)
(3, 5)
(4, 1)
(5, 3)
(6, 4)

c) Hallar el promedio de sueldos por departamento.

In [20]:
q('SELECT d.nombre AS nombreDpto, ROUND(AVG(e.salario),2) AS avgSalario FROM empleados e, departamentos d WHERE e.codigo_dep = d.codigo GROUP BY codigo_dep;')

['nombreDpto', 'avgSalario']
('Contable', 18050.0)
('RECURSOS HUMANOS', 15883.33)
('PRODUCCION', 13940.0)
('SISTEMAS', 22000.0)
('MARKETING', 25100.0)
('COMERCIALIZACION', 17975.0)

d) Detectar los productos que se han vendido más de una vez.

In [93]:
q('SELECT r.codigo_pro, COUNT(r.codigo_pro) AS Cantidad FROM renglones r GROUP BY r.codigo_pro HAVING count(*)>1;')

['codigo_pro', 'Cantidad']
(1000223, 4)
(1000225, 3)
(1002025, 2)
(1002106, 3)
(1034108, 2)
(1034219, 2)
(1034311, 2)
(1100333, 4)
(1100334, 2)
(4210002, 5)
(4452024, 2)
(4555102, 2)
(4555104, 2)
(4555108, 5)
(6007023, 3)
(6007045, 4)
(6007055, 4)
(6007066, 3)
(6008058, 2)
(6008070, 5)
(7078080, 4)
(7078090, 2)
(7078092, 4)
(8080803, 7)
(9002003, 2)
(9002006, 2)

e) Calcular la cantidad de hombres y mujeres que trabajan en cada
departamento.

In [101]:
q('SELECT e.codigo_dep, e.sexo, COUNT(*) AS cantidad FROM empleados e GROUP BY e.codigo_dep, e.sexo')

['codigo_dep', 'sexo', 'cantidad']
(1, 'M', 2)
(2, 'F', 2)
(2, 'M', 1)
(3, 'F', 2)
(3, 'M', 3)
(4, 'F', 1)
(5, 'F', 2)
(5, 'M', 1)
(6, 'F', 2)
(6, 'M', 2)

f) Mostrar la cantidad de empleados por departamento, para aquellos departamentos con más de 3 empleados.

In [104]:
q('SELECT e.codigo_dep, count(*) AS total FROM empleados e GROUP BY e.codigo_dep HAVING count(*) > 3;')

['codigo_dep', 'total']
(3, 5)
(6, 4)

### 4 COMBINACIÓN DE TABLAS Y CONSULTAS ANIDADAS

In [58]:
q(
'select name from sqlite_master where type="table";')

['name']
('departamentos',)
('empleados',)
('ordenes',)
('productos',)
('proveedores',)
('renglones',)

In [76]:
verTabla('renglones')

[(0, 'nro_orden', 'decimal(28,0)', 1, "'0'", 1),
 (1, 'nro_renglon', 'decimal(28,0)', 1, "'0'", 2),
 (2, 'codigo_pro', 'decimal(28,0)', 1, "'0'", 0),
 (3, 'precio', 'decimal(28,0)', 1, "'0'", 0),
 (4, 'cantidad', 'decimal(28,0)', 1, "'0'", 0)]

In [29]:
q('SELECT * FROM renglones')

['nro_orden', 'nro_renglon', 'codigo_pro', 'precio', 'cantidad']
(1, 1, 1000223, 10, 10)
(1, 2, 7078080, 41, 20)
(1, 3, 9002006, 41, 100)
(2, 1, 1100334, 40, 50)
(2, 2, 6007023, 61, 24)
(2, 3, 6007045, 120, 10)
(2, 4, 1034219, 54, 12)
(2, 5, 1034311, 30, 12)
(3, 1, 1000225, 71, 80)
(3, 2, 1100333, 230, 20)
(3, 3, 4210002, 120, 45)
(3, 4, 4210004, 61, 110)
(3, 5, 7078092, 120, 120)
(3, 6, 9002003, 340, 12)
(4, 1, 4555102, 50, 100)
(4, 2, 1034219, 5, 100)
(4, 3, 1034310, 10, 100)
(4, 4, 6008070, 30, 100)
(5, 1, 7078092, 31, 10)
(5, 2, 4210002, 10, 30)
(6, 1, 7078090, 31, 120)
(6, 2, 7078092, 230, 12)
(6, 3, 1002106, 380, 2)
(6, 4, 1000225, 30, 30)
(6, 5, 1000223, 81, 40)
(6, 6, 1002024, 31, 90)
(6, 7, 1100333, 10, 110)
(7, 1, 1100333, 10, 110)
(7, 2, 1034108, 230, 11)
(7, 3, 6007045, 30, 24)
(7, 4, 6007055, 41, 10)
(7, 5, 8080803, 51, 34)
(8, 1, 8080803, 61, 34)
(8, 2, 7078090, 61, 34)
(8, 3, 6008070, 120, 24)
(8, 4, 4555108, 50, 55)
(9, 1, 8080803, 61, 34)
(9, 2, 1034311, 10, 12)
(9, 3, 6007055, 6, 24)
(9, 4, 6007066, 91, 54)
(9, 5, 1034108, 20, 3)
(9, 6, 1000223, 10, 66)
(9, 7, 1000225, 60, 4)
(9, 8, 4555104, 60, 4)
(10, 1, 8080803, 60, 24)
(10, 2, 6007066, 50, 5)
(10, 3, 4210002, 11, 12)
(10, 4, 1002025, 21, 5)
(10, 5, 1002106, 120, 77)
(11, 1, 8080803, 60, 36)
(11, 2, 6008070, 70, 24)
(11, 3, 4555102, 50, 24)
(12, 1, 7078092, 60, 6)
(12, 2, 4452025, 30, 10)
(12, 3, 4210002, 10, 10)
(12, 4, 4210003, 6, 24)
(12, 5, 6007045, 31, 24)
(12, 6, 6007066, 21, 36)
(12, 7, 6008070, 11, 36)
(12, 8, 8080803, 40, 10)
(13, 1, 1100333, 31, 24)
(13, 2, 1000223, 21, 5)
(13, 3, 4555108, 40, 5)
(13, 4, 6007045, 121, 14)
(14, 1, 4555108, 41, 50)
(14, 2, 9002004, 10, 12)
(14, 3, 4555104, 51, 12)
(14, 4, 9002006, 230, 5)
(14, 5, 6008070, 10, 10)
(14, 6, 6007023, 10, 10)
(14, 7, 1002025, 51, 24)
(14, 8, 1000224, 20, 20)
(14, 9, 4210002, 6, 100)
(15, 1, 4555108, 41, 20)
(15, 2, 6007055, 10, 50)
(16, 1, 6007023, 41, 100)
(16, 2, 4555108, 21, 20)
(16, 3, 6008058, 30, 10)
(16, 4, 7078080, 10, 5)
(16, 5, 8080803, 61, 45)
(17, 1, 7078080, 10, 5)
(17, 2, 6008058, 11, 10)
(17, 3, 6007055, 20, 12)
(17, 4, 4452024, 50, 12)
(17, 5, 1002106, 11, 12)
(17, 6, 9002003, 100, 5)
(18, 1, 4452024, 50, 12)
(18, 2, 1100334, 21, 12)
(18, 3, 7078080, 20, 12)

a) Listar los códigos, nombres de proveedores, y cantidad total comprada.

In [86]:
q('SELECT o.codigo_prv, p.nombre, SUM(r.precio*r.cantidad) AS cantidadComprada FROM proveedores p, ordenes o, renglones r WHERE o.codigo_prv = p.codigo AND o.nro_orden = r.nro_orden GROUP BY o.codigo_prv ORDER BY p.codigo')

['codigo_prv', 'nombre', 'cantidadComprada']
(1, 'ATALAYA S.R.L.', 5020)
(2, 'ROCAMORA E HIJOS', 9500)
(3, 'LA PERUANA', 12028)
(4, 'RUTA S.A.', 40870)
(5, 'COMODINES', 1702)
(6, 'LA SEXTA', 18230)
(7, 'AGUSTINEZ Y HERMANOS S.A.', 8935)
(8, 'PEREZ, PEREZ, Y RODRIGUEZ', 16207)
(9, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 3200)
(11, 'PARIS', 2743)
(12, 'MIS LAPICES', 23396)

b) Listar para cada proveedor el nombre, número de orden, productos y descripción del mismo.

In [33]:
q('SELECT o.nro_orden, p.nombre AS proveedor, r.codigo_pro, s.nombre AS descripcion FROM ordenes o, proveedores p, renglones r, productos s WHERE o.codigo_prv = p.codigo AND o.nro_orden = r.nro_orden AND r.codigo_pro = s.codigo ORDER BY p.nombre;')

['nro_orden', 'proveedor', 'codigo_pro', 'descripcion']
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 7078092, 'CLIPS PLASTICOS COLOR C045')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 4452025, 'RESMA PAPEL BLANCO OFICIO')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 4210002, 'LAPIZ NEGRO')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 4210003, 'LAPIZ COLOR CAJA 12 UNIDADES')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 6007045, 'BLOCK ECOLOGICO LISO')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 6007066, 'BLOCK ECOLOGICO RAYADO')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 6008070, 'CRAYONES CAJA 12 UNIDADES')
(12, 'AGUSTIN FERNANDEZ Y ASOCIADOS', 8080803, 'BIROME TRAZO GRUESO')
(15, 'AGUSTINEZ Y HERMANOS S.A.', 4555108, 'AGENDA RICO MC.PATO C/CALCULADORA')
(15, 'AGUSTINEZ Y HERMANOS S.A.', 6007055, 'BLOCK ECOLOGICO CUADRICULADO')
(16, 'AGUSTINEZ Y HERMANOS S.A.', 6007023, 'CUADERNO ECOLOGICO CUADRICULADO')
(16, 'AGUSTINEZ Y HERMANOS S.A.', 4555108, 'AGENDA RICO MC.PATO C/CALCULADORA')
(16, 'AGUSTINEZ Y HERMANOS S.A.', 6008058, 'RESALTADOR FLUO DOS COLORES')
(16, 'AGUSTINEZ Y HERMANOS S.A.', 7078080, 'CLIPS METALICOS')
(16, 'AGUSTINEZ Y HERMANOS S.A.', 8080803, 'BIROME TRAZO GRUESO')
(1, 'ATALAYA S.R.L.', 1000223, 'LAPICERA BOLIGRAFO')
(1, 'ATALAYA S.R.L.', 7078080, 'CLIPS METALICOS')
(1, 'ATALAYA S.R.L.', 9002006, 'REPUESTO HOJAS PIZARRA')
(5, 'COMODINES', 7078092, 'CLIPS PLASTICOS COLOR C045')
(5, 'COMODINES', 4210002, 'LAPIZ NEGRO')
(18, 'COMODINES', 4452024, 'RESMA PAPEL BLANCO CARTA')
(18, 'COMODINES', 1100334, 'MARCADOR PUNTA GRUESA')
(18, 'COMODINES', 7078080, 'CLIPS METALICOS')
(2, 'LA PERUANA', 1100334, 'MARCADOR PUNTA GRUESA')
(2, 'LA PERUANA', 6007023, 'CUADERNO ECOLOGICO CUADRICULADO')
(2, 'LA PERUANA', 6007045, 'BLOCK ECOLOGICO LISO')
(2, 'LA PERUANA', 1034219, 'REPUESTO HOJA RALLADA')
(2, 'LA PERUANA', 1034311, 'REPUESTO HOJA PENTAGRAMA')
(14, 'LA PERUANA', 4555108, 'AGENDA RICO MC.PATO C/CALCULADORA')
(14, 'LA PERUANA', 9002004, 'PIZARRON')
(14, 'LA PERUANA', 4555104, 'AGENDA BARBY')
(14, 'LA PERUANA', 9002006, 'REPUESTO HOJAS PIZARRA')
(14, 'LA PERUANA', 6008070, 'CRAYONES CAJA 12 UNIDADES')
(14, 'LA PERUANA', 6007023, 'CUADERNO ECOLOGICO CUADRICULADO')
(14, 'LA PERUANA', 1002025, 'CARPETA NRO 6')
(14, 'LA PERUANA', 1000224, 'LAPICERA FUENTE')
(14, 'LA PERUANA', 4210002, 'LAPIZ NEGRO')
(8, 'LA SEXTA', 8080803, 'BIROME TRAZO GRUESO')
(8, 'LA SEXTA', 7078090, 'CLIPS PLASTICOS COLOR C023')
(8, 'LA SEXTA', 6008070, 'CRAYONES CAJA 12 UNIDADES')
(8, 'LA SEXTA', 4555108, 'AGENDA RICO MC.PATO C/CALCULADORA')
(9, 'LA SEXTA', 8080803, 'BIROME TRAZO GRUESO')
(9, 'LA SEXTA', 1034311, 'REPUESTO HOJA PENTAGRAMA')
(9, 'LA SEXTA', 6007055, 'BLOCK ECOLOGICO CUADRICULADO')
(9, 'LA SEXTA', 6007066, 'BLOCK ECOLOGICO RAYADO')
(9, 'LA SEXTA', 1034108, 'PLASTICOLA')
(9, 'LA SEXTA', 1000223, 'LAPICERA BOLIGRAFO')
(9, 'LA SEXTA', 1000225, 'CUADERNO  50 HOJAS')
(9, 'LA SEXTA', 4555104, 'AGENDA BARBY')
(6, 'MIS LAPICES', 7078090, 'CLIPS PLASTICOS COLOR C023')
(6, 'MIS LAPICES', 7078092, 'CLIPS PLASTICOS COLOR C045')
(6, 'MIS LAPICES', 1002106, 'CARTULINA')
(6, 'MIS LAPICES', 1000225, 'CUADERNO  50 HOJAS')
(6, 'MIS LAPICES', 1000223, 'LAPICERA BOLIGRAFO')
(6, 'MIS LAPICES', 1002024, 'CUADERNO 100 HOJAS')
(6, 'MIS LAPICES', 1100333, 'MARCADOR PUNTA FINA')
(7, 'MIS LAPICES', 1100333, 'MARCADOR PUNTA FINA')
(7, 'MIS LAPICES', 1034108, 'PLASTICOLA')
(7, 'MIS LAPICES', 6007045, 'BLOCK ECOLOGICO LISO')
(7, 'MIS LAPICES', 6007055, 'BLOCK ECOLOGICO CUADRICULADO')
(7, 'MIS LAPICES', 8080803, 'BIROME TRAZO GRUESO')
(17, 'MIS LAPICES', 7078080, 'CLIPS METALICOS')
(17, 'MIS LAPICES', 6008058, 'RESALTADOR FLUO DOS COLORES')
(17, 'MIS LAPICES', 6007055, 'BLOCK ECOLOGICO CUADRICULADO')
(17, 'MIS LAPICES', 4452024, 'RESMA PAPEL BLANCO CARTA')
(17, 'MIS LAPICES', 1002106, 'CARTULINA')
(17, 'MIS LAPICES', 9002003, 'PIZARRA BLANCA')
(13, 'PARIS', 1100333, 'MARCADOR PUNTA FINA')
(13, 'PARIS', 1000223, 'LAPICERA BOLIGRAFO')
(13, 'PARIS', 4555108, 'AGENDA RICO MC.PATO C/CALCULADORA')
(13, 'PARIS', 6007045, 'BLOCK ECOLOGICO LISO')
(10, 'PEREZ, PEREZ, Y RODRIGUEZ', 8080803, 'BIROME TRAZO GRUESO')
(10, 'PEREZ, PEREZ, Y RODRIGUEZ', 6007066, 'BLOCK ECOLOGICO RAYADO')
(10, 'PEREZ, PEREZ, Y RODRIGUEZ', 4210002, 'LAPIZ NEGRO')
(10, 'PEREZ, PEREZ, Y RODRIGUEZ', 1002025, 'CARPETA NRO 6')
(10, 'PEREZ, PEREZ, Y RODRIGUEZ', 1002106, 'CARTULINA')
(11, 'PEREZ, PEREZ, Y RODRIGUEZ', 8080803, 'BIROME TRAZO GRUESO')
(11, 'PEREZ, PEREZ, Y RODRIGUEZ', 6008070, 'CRAYONES CAJA 12 UNIDADES')
(11, 'PEREZ, PEREZ, Y RODRIGUEZ', 4555102, 'AGENDA MICKEY')
(4, 'ROCAMORA E HIJOS', 4555102, 'AGENDA MICKEY')
(4, 'ROCAMORA E HIJOS', 1034219, 'REPUESTO HOJA RALLADA')
(4, 'ROCAMORA E HIJOS', 1034310, 'REPUESTO HOJA CUADRICULADA')
(4, 'ROCAMORA E HIJOS', 6008070, 'CRAYONES CAJA 12 UNIDADES')
(3, 'RUTA S.A.', 1000225, 'CUADERNO  50 HOJAS')
(3, 'RUTA S.A.', 1100333, 'MARCADOR PUNTA FINA')
(3, 'RUTA S.A.', 4210002, 'LAPIZ NEGRO')
(3, 'RUTA S.A.', 4210004, 'LAPIZ COLOR CAJA 24 UNIDADES')
(3, 'RUTA S.A.', 7078092, 'CLIPS PLASTICOS COLOR C045')
(3, 'RUTA S.A.', 9002003, 'PIZARRA BLANCA')

c) Listar los nombres de los productos correspondientes a órdenes cuyo tipo de pago es CONTADO.

In [ ]:
q('')

d) Listar los nombres de los diferentes productos que han sido ordenados.

In [ ]:
q('')

e) Detectar cuáles productos no han sido ordenados.

In [ ]:
q('')

f) Recuperar el nombre y el departamento de los empleados de mayor sueldo y de los de menor sueldo indicando en una columna la condición de mayor o de menor según corresponda.

In [ ]:
q('')

g) Obtener el departamento de los empleados que cobran, al menos, el doble que el sueldo promedio de los empleados.

In [ ]:
q('')

h) Listar el nombre, puesto, sexo y salario de todos los empleados que tienen un salario superior al salario más bajo. Ordenar la recuperación por salario en forma ascendente.

In [ ]:
q('')

i) Listar las personas que ganen más de 950 pesos que el miembro del personal de sueldo más alto de sexo masculino. Indicar si son hombres o mujeres y su salario.

In [ ]:
q('')

### 5. CREACION DE TABLAS Y MODIFICACIÓN DE DATOS

a)